iota2/iota2-hub/app/inc/stm32f4xx_hal_conf.h
/* Tip: To avoid modifying this file each time you need to use different HSE,
   ===  you can define the HSE value in your toolchain compiler preprocessor. */

/* ########################### System Configuration ######################### */
/**
 * @defgroup HAL_SYSTEM_CONFIG HAL system configuration section.
 * Different configurations definition for configuring system HAL support.
 *
 * @{
 */
#define  VDD_VALUE                    (3300U) /*!< Value of VDD in mv */
#define  TICK_INT_PRIORITY            (0x0FU) /*!< tick interrupt priority */
#define  USE_RTOS                     0 /*!< Define to enable RTOS integration*/
#define  PREFETCH_ENABLE              0 /*!< The prefetch will be enabled in
                                             SystemClock_Config(), depending on
                                             the used STM32F405/415/07/417
                                             device: RevA (prefetch must be off)
                                             or RevZ (prefetch can be on/off) */
#define  INSTRUCTION_CACHE_ENABLE     1   /*!< Define to enable instruction caching */
#define  DATA_CACHE_ENABLE            1U  /*!< Define to enable data caching */

#define  USE_HAL_ADC_REGISTER_CALLBACKS         0U /*!< ADC register callback disabled       */
#define  USE_HAL_CAN_REGISTER_CALLBACKS         0U /*!< CAN register callback disabled       */
#define  USE_HAL_CEC_REGISTER_CALLBACKS         0U /*!< CEC register callback disabled       */
#define  USE_HAL_CRYP_REGISTER_CALLBACKS        0U /*!< CRYP register callback disabled      */
#define  USE_HAL_DAC_REGISTER_CALLBACKS         0U /*!< DAC register callback disabled       */
#define  USE_HAL_DCMI_REGISTER_CALLBACKS        0U /*!< DCMI register callback disabled      */
#define  USE_HAL_DFSDM_REGISTER_CALLBACKS       0U /*!< DFSDM register callback disabled     */
#define  USE_HAL_DMA2D_REGISTER_CALLBACKS       0U /*!< DMA2D register callback disabled     */
#define  USE_HAL_DSI_REGISTER_CALLBACKS         0U /*!< DSI register callback disabled       */
#define  USE_HAL_ETH_REGISTER_CALLBACKS         0U /*!< ETH register callback disabled       */
#define  USE_HAL_HASH_REGISTER_CALLBACKS        0U /*!< HASH register callback disabled      */
#define  USE_HAL_HCD_REGISTER_CALLBACKS         0U /*!< HCD register callback disabled       */
#define  USE_HAL_I2C_REGISTER_CALLBACKS         0U /*!< I2C register callback disabled       */
#define  USE_HAL_FMPI2C_REGISTER_CALLBACKS      0U /*!< FMPI2C register callback disabled    */
#define  USE_HAL_I2S_REGISTER_CALLBACKS         0U /*!< I2S register callback disabled       */
#define  USE_HAL_IRDA_REGISTER_CALLBACKS        0U /*!< IRDA register callback disabled      */
#define  USE_HAL_LPTIM_REGISTER_CALLBACKS       0U /*!< LPTIM register callback disabled     */
#define  USE_HAL_LTDC_REGISTER_CALLBACKS        0U /*!< LTDC register callback disabled      */
#define  USE_HAL_MMC_REGISTER_CALLBACKS         0U /*!< MMC register callback disabled       */
#define  USE_HAL_NAND_REGISTER_CALLBACKS        0U /*!< NAND register callback disabled      */
#define  USE_HAL_NOR_REGISTER_CALLBACKS         0U /*!< NOR register callback disabled       */
#define  USE_HAL_PCCARD_REGISTER_CALLBACKS      0U /*!< PCCARD register callback disabled    */
#define  USE_HAL_PCD_REGISTER_CALLBACKS         0U /*!< PCD register callback disabled       */
#define  USE_HAL_QSPI_REGISTER_CALLBACKS        0U /*!< QSPI register callback disabled      */
#define  USE_HAL_RNG_REGISTER_CALLBACKS         0U /*!< RNG register callback disabled       */
#define  USE_HAL_RTC_REGISTER_CALLBACKS         0U /*!< RTC register callback disabled       */
#define  USE_HAL_SAI_REGISTER_CALLBACKS         0U /*!< SAI register callback disabled       */
#define  USE_HAL_SD_REGISTER_CALLBACKS          0U /*!< SD register callback disabled        */
#define  USE_HAL_SMARTCARD_REGISTER_CALLBACKS   0U /*!< SMARTCARD register callback disabled */
#define  USE_HAL_SDRAM_REGISTER_CALLBACKS       0U /*!< SDRAM register callback disabled     */
#define  USE_HAL_SRAM_REGISTER_CALLBACKS        0U /*!< SRAM register callback disabled      */
#define  USE_HAL_SPDIFRX_REGISTER_CALLBACKS     0U /*!< SPDIFRX register callback disabled   */
#define  USE_HAL_SMBUS_REGISTER_CALLBACKS       0U /*!< SMBUS register callback disabled     */
#define  USE_HAL_SPI_REGISTER_CALLBACKS         0U /*!< SPI register callback disabled       */
#define  USE_HAL_TIM_REGISTER_CALLBACKS         0U /*!< TIM register callback disabled       */
#define  USE_HAL_UART_REGISTER_CALLBACKS        0U /*!< UART register callback disabled      */
#define  USE_HAL_USART_REGISTER_CALLBACKS       0U /*!< USART register callback disabled     */
#define  USE_HAL_WWDG_REGISTER_CALLBACKS        0U /*!< WWDG register callback disabled      */
/** @} */ /* HAL_SYSTEM_CONFIG */

/* ########################## Assert Selection ############################## */
/**
 * @brief Uncomment the line below to expanse the "assert_param" macro in the
 *        HAL drivers code
 */
#ifndef USE_FULL_ASSERT
#define USE_FULL_ASSERT    0    /*!< Defined to Use System Assert, Using makefile for assert options */
#endif  /* USE_FULL_ASSERT */

/* ################## Ethernet peripheral configuration ##################### */
/**
 * @defgroup HAL_ETH_CONFIG Ethernet peripheral configuration.
 * Configurations for using Ethernet peripheral.
 *
 * @{
 */

/**
 * @defgroup HAL_ETH_CONFIG_PERIPH Section 1 : Ethernet peripheral configuration.
 * HAL Ethernet configurations related to peripheral settings.
 *
 * @{
 */

/**
 * @defgroup HAL_ETH_CONFIG_PERIPH_MAC MAC address.
 * MAC ADDRESS: MAC_ADDR0:MAC_ADDR1:MAC_ADDR2:MAC_ADDR3:MAC_ADDR4:MAC_ADDR5.
 *
 * @{
 */
#define MAC_ADDR0   2   /*!< MAC Address Byte 1 : MSB */
#define MAC_ADDR1   0   /*!< MAC Address Byte 2       */
#define MAC_ADDR2   0   /*!< MAC Address Byte 3       */
#define MAC_ADDR3   0   /*!< MAC Address Byte 4       */
#define MAC_ADDR4   0   /*!< MAC Address Byte 5       */
#define MAC_ADDR5   0   /*!< MAC Address Byte 6 : LSB */
/** @} */ /* HAL_ETH_CONFIG_PERIPH_MAC */

/**
 * @defgroup HAL_ETH_CONFIG_PERIPH_BUF Ethernet buffer configurations.
 * Definition of the Ethernet driver buffers size and count.
 *
 * @{
 */
#define ETH_RX_BUF_SIZE                ETH_MAX_PACKET_SIZE  /*!< buffer size for Ethernet receive buffer */
#define ETH_TX_BUF_SIZE                ETH_MAX_PACKET_SIZE  /*!< buffer size for Ethernet transmit buffer */
#define ETH_RXBUFNB                    (4U)                 /*!< 4 Rx buffers of size ETH_RX_BUF_SIZE  */
#define ETH_TXBUFNB                    (4U)                 /*!< 4 Tx buffers of size ETH_TX_BUF_SIZE  */
/** @} */ /* HAL_ETH_CONFIG_PERIPH_BUF */

/** @} */ /* HAL_ETH_CONFIG_PERIPH */

/**
* @defgroup HAL_ETH_CONFIG_PHY Section 2: PHY configuration section.
* HAL Ethernet configurations related to PHY.
*
* @{
*/

/**
* @defgroup HAL_ETH_CONFIG_PHY_SETUP Ethernet PHY set up.
* Set up configuration for Ethernet PHY.
*
* @{
*/
#define DP83848_PHY_ADDRESS             (0x01)          /*!< DP83848 PHY Address. */
#define PHY_RESET_DELAY                 (0x000000FFU)   /*!< PHY Reset delay these values are based on a 1 ms Systick interrupt*/
#define PHY_CONFIG_DELAY                (0x00000FFFU)   /*!< PHY Configuration delay */
/** @} */ /* HAL_ETH_CONFIG_PHY_SETUP */

/**
 * @defgroup HAL_ETH_CONFIG_PHY_BUF PHY buffer configurations.
 * Defining read / write addresses for PHY.
 *
 * @{
 */
#define PHY_READ_TO                     (0x0000FFFFU)   /*!< PHY read to address */
#define PHY_WRITE_TO                    (0x0000FFFFU)   /*!< PHY write to address */
/** @} */ /* HAL_ETH_CONFIG_PHY_BUF */

/** @} */ /* HAL_ETH_CONFIG_PHY */

/**
 * @defgroup HAL_ETH_CONFIG_REG Section 3: Common PHY Registers.
 * Registes definitions for controlling Ethernet PHY.
 *
 * @{
 */

/**
 * @defgroup HAL_ETH_CONFIG_REG_BASIC Basic PHY registers.
 * Basic registers for PHY integrations (SR and CR).
 *
 * @{
 */
#define PHY_BCR                         ((uint16_t)0x00)    /*!< Transceiver Basic Control Register   */
#define PHY_BSR                         ((uint16_t)0x01)    /*!< Transceiver Basic Status Register    */
/** @} */ /* HAL_ETH_CONFIG_REG_BASIC */

/**
 * @defgroup HAL_ETH_CONFIG_REG_CONFIG PHY configuration registers.
 * Registers for configuring PHY settings.
 *
 * @{
 */
#define PHY_RESET                       ((uint16_t)0x8000)  /*!< PHY Reset */
#define PHY_LOOPBACK                    ((uint16_t)0x4000)  /*!< Select loop-back mode */
#define PHY_FULLDUPLEX_100M             ((uint16_t)0x2100)  /*!< Set the full-duplex mode at 100 Mb/s */
#define PHY_HALFDUPLEX_100M             ((uint16_t)0x2000)  /*!< Set the half-duplex mode at 100 Mb/s */
#define PHY_FULLDUPLEX_10M              ((uint16_t)0x0100)  /*!< Set the full-duplex mode at 10 Mb/s  */
#define PHY_HALFDUPLEX_10M              ((uint16_t)0x0000)  /*!< Set the half-duplex mode at 10 Mb/s  */
#define PHY_AUTONEGOTIATION             ((uint16_t)0x1000)  /*!< Enable auto-negotiation function     */
#define PHY_RESTART_AUTONEGOTIATION     ((uint16_t)0x0200)  /*!< Restart auto-negotiation function    */
#define PHY_POWERDOWN                   ((uint16_t)0x0800)  /*!< Select the power down mode           */
#define PHY_ISOLATE                     ((uint16_t)0x0400)  /*!< Isolate PHY from MII                 */
/** @} */ /* HAL_ETH_CONFIG_REG_CONFIG */

/**
 * @defgroup HAL_ETH_CONFIG_REG_CONTROL PHY control registers.
 * Registers for controlling PHY behavior.
 *
 * @{
 */
#define PHY_AUTONEGO_COMPLETE           ((uint16_t)0x0020)  /*!< Auto-Negotiation process completed   */
#define PHY_LINKED_STATUS               ((uint16_t)0x0004)  /*!< Valid link established               */
#define PHY_JABBER_DETECTION            ((uint16_t)0x0002)  /*!< Jabber condition detected            */
/** @} */ /* HAL_ETH_CONFIG_REG_CONTROL */

